import { ReactNode } from "react";
import { notFound } from "next/navigation";
import { TopServiceSection } from "@/sections/TopServiceSection";
import { ListFeaturesSection } from "@/sections/ListFeaturesSection";
import { ActivityGridSection } from "@/sections/ActivityGridSection";

type Service = {
  title: ReactNode | string;
  sub: string;
  desc: string;
  img: string;
  features: string[];
  activities: {
    category: string;
    title: string;
    text: string;
    isPopuped: boolean
  }[];
}

const SERVICES: Record<string, Service> = {
  'civilni-spravy': {
    title: <>Цивільні<br/> <span className="text-[#FFBF37] italic">справи</span></>,
    sub: 'Захищаємо особисте, майнове та сімейне — те, що має для вас справжню цінність.',
    desc: 'Надаємо комплексну правничу допомогу у приватноправових спорах: від аналізу документів і переговорів до представництва в судах усіх інстанцій та фактичного виконання рішення.',
    img: '/img/service-civil.jpg',
    features: [
      "Повний правовий супровід спадкових справ",
      "Судове оскарження дій нотаріату",
      "Юридичний супровід спадщини на земельний пай",
      "Спаткування прав на об'єкти інтелектуальної власності",
      "Захист прав пацієнтів у складних медичних справах, компенсація у випадку лікарської помилки",
      "Повний супровід справ про відшкодування шкоди",
      "Відшкодування збитків, завданих війною, відновлення зруйнованого житла",
      "Стягнення шкоди при порушенні прав споживачів",
      "Захист інтелектуальної власності, стягнення шкоди при порушенні авторського права",
      "Захист права власності від сторонніх посягань",
      "Визнання особи недієздатною",
      "Стягнення боргів",
    ],
    activities: [
      {
        category: "Спадковий спір",
        title: "Визнання права власності на спадкове майно",
        text: "Клієнт пропустив строк прийняття спадщини через тривале перебування за кордоном. Команда зібрала докази поважності причин та підтвердила фактичне прийняття майна.",
        isPopuped: false,
      },
      {
        category: "Право власності",
        title: "Повернення квартири законному власнику",
        text: "Нерухомість вибула з володіння клієнта на підставі підроблених документів. У суді доведено незаконність реєстраційних дій та скасовано подальші договори.",
        isPopuped: false,
      },
      {
        category: "Відшкодування шкоди",
        title: "Компенсація збитків після дорожньої пригоди",
        text: "Страхова компанія відмовила у повній виплаті. Незалежна оцінка та послідовна правова позиція дозволили стягнути вартість ремонту, експертизи й судові витрати.",
        isPopuped: false,
      },
      {
        category: "Договірний спір",
        title: "Стягнення боргу за договором позики",
        text: "Боржник заперечував факт отримання коштів та справжність розписки. Почеркознавча експертиза й банківські документи підтвердили вимоги в повному обсязі.",
        isPopuped: false,
      },
      {
        category: "Земельний спір",
        title: "Відновлення меж земельної ділянки",
        text: "Через помилку в кадастрі частина ділянки клієнта накладалася на сусідню. Після землевпорядної експертизи суд скасував помилкову реєстрацію та відновив межі.",
        isPopuped: false,
      },
    ]
  },
  'administrativni-spravy': {
    title: <>Адміністративні<br/> <span className="text-[#FFBF37] italic">справи</span></>,
    sub: 'Податкові спори, міграційні питання, оскарження штрафів і дій чиновників, бізнес-дозволи, виборче право — повний правовий супровід усіх адміністративних справ',
    desc: '',
    img: '/img/service-admin.jpg',
    features: [
      "Податкові спори:  штрафи, перевірки, накладні",
      "Повна юридична допомога з податкових питань",
      "Міграційні справи: посвідки, громадянство, депортація",
      "Захист інтересів іноземців у судах",
      "Оскарження дій чи бездіяльності посадових осіб",
      "Оскарження рішення міграційної служби",
      "Оскарження адміністративних рішень та штрафів",
      "Оскарження рішення колегіального органу",
      "Юридична допомога у тендерних спорах",
      "Отримання дозвільних документів"
    ],
    activities: []
  },
  'gospodarsky-spravy': {
    title: <>Господарські<br/> <span className="text-[#FFBF37] italic">справи</span></>,
    sub: 'Корпоративні спори, договори, стягнення боргів, тендери, банкрутство, аутсорсинг — повний правовий супровід для ТОВ, ФОП, фермерських господарств та інших суб\'єктів господарювання',
    desc: '',
    img: '/img/service-gosp.jpg',
    features: [
      "Реєстрація і запуск бізнесу",
      "Юридичний супровід підприємницької діяльності",
      "Юридичний супровід ОСББ",
      "Корпоративні спори, тендери",
      "Захист ділової репутації юридичної особи",
      "Визнання господарського договору недійсним",
      "Стягнення боргів у господарських справах",
      "Ведення справ про банкрутство підприємств",
      "Ліквідація юридичної особи"
    ],
    activities: []
  },
  'vyiskovi-spravy': {
    title: <>Військові<br/> <span className="text-[#FFBF37] italic">справи</span></>,
    sub: 'Вирішуємо справи будь-якої складності від оскарження рішень ВЛК, оформлення відстрочки до захисту в кримінальних провадженнях та стягнення виплат за поранення',
    desc: 'Замовте юридичну консультацію наших адвокатів та отримайте покрокову інструкцію вирішення вашого питання',
    img: '/img/service-army.jpg',
    features: [
      "Юридичний супровід оформлення відстрочки від мобілізації",
      "Оскарження рішень ВЛК, та процедурні порушення ТЦК, в тому числі, дій посадових осіб ТЦК",
      "Захист при незаконному затриманні ТЦК",
      "Оскарження штрафних санкцій ТЦК",
      "Допомога у стягненні виплат військовим за період лікування, за участь у бойових діях, за поранення тощо",
      "Допомога у оформленні пенсій військовослужбовцям",
      "Захист військових у адміністративних та кримінальних провадженнях",
      "Допомога членам сім’ї  військового щодо отримання пільг та виплат допомоги"
    ],
    activities: []
  },
  'cryminalni-spravy': {
    title: <>Кримінальні<br/> <span className="text-[#FFBF37] italic">справи</span></>,
    sub: 'Затримання, обшук, досудове розслідування, суд, апеляція, ЄСПЛ — захист підозрюваних, обвинувачених, бізнесу і потерпілих у будь-якій кримінальній ситуації',
    desc: '',
    img: '/img/service-crime.jpg',
    features: [
      "Підозрювані та обвинувачені: захист на всіх стадіях",
      "Правова допомога особі, яка підозрюється у злочині",
      "Захист обвинуваченого у злочині на всіх стадіях",
      "Бізнес-злочини: економічні справи, рейдерство, корупція",
      "Превентивна перевірка кримінально-правових ризиків",
      "Оцінка загроз для суб'єкта господарювання",
      "Спеціалізовані категорії: наркотики, шахрайство, кіберзлочини, зброя",
      "Захист у справах про шахрайство будь-якої складності",
      "Стягнення шкоди у кримінальному провадженні",
      "Захист права засуджених під час відбуття покарання"
    ],
    activities: []
  },
  'trydovi-spravy': {
    title: <>Трудові та пенсійні<br/> <span className="text-[#FFBF37] italic">справи</span></>,
    sub: 'Незаконне звільнення, невиплачена зарплата, занижена пенсія, травма на виробництві — ми знаємо, як змусити роботодавця, Пенсійний фонд або державну установу виплатити вам кошти, яка вам належить за законом',
    desc: '',
    img: '/img/service-job.jpg',
    features: [
      "Незаконне звільнення та поновлення на роботі",
      "Заробітна плата: стягнення невиплаченої заробітної плати, зняття арешту з заробітної плати",
      "Травма на виробництві та шкідлива праця, стягнення шкоди від шкідливого виробництва, стягнення моральної шкоди при травмі на виробництві",
      "Порушення трудових прав, дискримінація, оскарження дисціплінарного стягнення",
      "Неправоміне покладення матеріальної відповідальності",
      "Дискримінація та булінг на робочому місці",
      "Пенсії: оформлення, перерахунок, збільшення, повна юридична підтримка у пенсійних питаннях",
      "Військова та спеціальна пенсія. Оскарження непроведення перерахунку пенсій військовослужбовців",
    ],
    activities: []
  },
  'symeini-spravy': {
    title: <>Сімейні<br/> <span className="text-[#FFBF37] italic">справи</span></>,
    sub: 'Розлучення, аліменти, поділ майна, діти — ми вирішуємо найскладніші сімейні справи в Україні та за кордоном',
    desc: '',
    img: '/img/service-family.jpg',
    features: [
      "Розлучення та припинення шлюбу",
      "Поділ майна подружжя",
      "Розполіл корпоративних прав при розлученні",
      "Аліменти: стягнення, зміна, контроль, повний супровід стягнення аліментів",
      "Спори щодо дітей: місце проживання, спілкування, виїзд",
      "Захист прав дітей і підлітків у будь-яких справах",
      "Встановлення батьківства та факту родинних відносин у судовому порядку",
      "Встановлення факту проживання однією сім'єю без реєстрації шлюбу",
      "Юридичний супровід усиновлення",
      "Встановлення опіки та піклування над дитиною або недієздатною особою",
    ],
    activities: []
  },
  'creditni-spravy': {
    title: <>Кредитні<br/> <span className="text-[#FFBF37] italic">справи</span></>,
    sub: 'Кредити, іпотека, банкрутство, арешт рахунків — ми вирішуємо найскладніші фінансові проблеми та повертаємо клієнтам контроль над їхнім життям',
    desc: 'Ми робимо це щодня — законно, в рамках чинного законодавства, з гарантією результату',
    img: '/img/service-cred.jpg',
    features: [
      "Банкрутство фізичної особи: законне списання боргу",
      "Захист ваших інтересів у процедурі банкрутства",
      "Спори з банками: суди, оскарження, повернення коштів",
      "Оскарження кредитного боргу",
      "Кредитні спори з банками",
      "иконавче провадження: арешти, стягнення, оскарження",
      "Арешт рахунків, карток, майна: зняття та захист",
      "Виконавчий напис нотаріуса: оскарження",
      "Іпотека та заставне майно, спори за іпотечними договорами",
      "Поручительство: захист від чужих боргів"
    ],
    activities: []
  }
}

export default async function ServicePage({ params }: { params: Promise<{ alias: string }> }) {
  const { alias } = await params;
  let data: Service;

  if (SERVICES[alias]) {
    data = SERVICES[alias];
  } else {
    return notFound();
  }

  return (
    <>
      <TopServiceSection title={data.title} sub={data.sub} desc={data.desc} img={data.img} />
      <ListFeaturesSection list={data.features} />
      <ActivityGridSection activities={data.activities} />
    </>
  )
}