import { Title } from "@/components/Title";
import { BigNumber } from "@/components/BigNumber";

export function AboutSection() {
  return (
    <section id="about" className="py-15 px-6 md:py-36 md:px-16 bg-[#FAFAF8]" aria-label="Про нас">
      <div className="max-w-6xl mx-auto text-center">

        <Title sup={"Адвокатське об'єднання"} title={"Про нас"} />

        <div className="text-[16px] text-[#3D3229] opacity-85 leading-relaxed mb-8 md:text-xl">
          <p className="mb-6">Адвокатське об’єднання «Громада і Закон» засновано в 2021 році за ініціативою Всеукраїнської громадської організації «Громада і Закон», основним напрямком діяльності якої є захист прав та свобод громадян.</p>
          <p className="mb-6">ВГО «Громада і Закон» створена в 2010 році, її незмінним лідером та засновником є Ільницький Михайло Степанович, доктор юридичних наук, професор Київського Міжнародного Університету, секретар Координаційної ради  Національної академії правових наук, відомий громадський діяч.</p>
          <p className="mb-6">На даний час, ВГО «Громада і Закон» налічує більше 50 000 членів своєї організації, має розгалужену структуру по всій території Україні  та за її межами. Відділення громадської організації відкриті у всіх областях  та в більшості районах України.</p>
        </div>
        <div className="text-base text-[#3D3229] opacity-65 leading-relaxed md:text-lg">
          <p className="mb-5">Для того, щоб надавати професійну правову допомогу по всій території України, для забезпечення доступу до правової допомоги, Адвокатське об’єднання «Громада і Закон» створює мережу своїх регіональних представництв у всіх областях України.</p>
          <p className="mb-5">Головний офіс розташований у місті Києві. Створена філія у західному регіоні у місті Івано-Франківськ. Ми маємо представників у всіх областях України та проводимо роботу по створенню відділень та представництв по всій території України.</p>
          <p className="mb-5">Наша команда - це адвокати з великим досвідом правозахисної діяльності, експерти в певній галузі права, які постійно вдосконалюють свої професійні навички.</p>
        </div>
      </div>

      <div className="max-w-4xl mx-auto mt-20 grid grid-cols-2 md:grid-cols-4 gap-8 md:gap-4">
        <BigNumber value={'2021'} label={'Рік заснування'} />
        <BigNumber value={'100+'} label={'Виграних справ'} />
        <BigNumber value={'5+'} label={'Років досвіду'} />
        <BigNumber value={'20'} label={'Адвокатів у команді'} />
      </div>
    </section>
  )
}