import { Title } from "@/components/Title";
import { Person } from "@/components/Person";

const TEAM = [
  {
    name: "Горбунова Лідія Миколаївна",
    role: "Голова Адвокатського об’єднання",
    bio: "Кандидат юридичних наук, доцент, заслужений юрист Україні. Має великій досвід роботи у проведенні правової експертизи нормативно-правових актів та міжнародних договорів, більше 20 років працювала в Міністерстві юстиції України, з них 11 років займала посаду Заступника Міністра юстиції. Адвокат з великім досвідом адвокатської діяльності в галузі адміністративного, цивільного та господарського права.",
    photo: "/img/Lidia.jpg",
  },
  {
    name: "Мирослав Гусельников",
    role: "Партнер Адвокатського об’єднання",
    bio: "Адвокат із понад 25-річним професійним досвідом. Спеціалізується на захисті інтересів власників бізнесу, підприємців і керівників компаній у складних кримінальних, господарських, цивільних та адміністративних спорах. Має значний досвід ведення резонансних і комплексних судових справ, кримінального захисту бізнесу та розробки процесуальних і переговорних стратегій. У роботі поєднує глибокий правовий аналіз із розумінням бізнес-ризиків та практичних наслідків юридичних рішень.",
    photo: "/img/Guselnikov.jpg",
  },
  {
    name: "Вадим Яксманецький",
    role: "Асоційований партнер",
    bio: "Адвокат із 15-річним стажем роботи в органах прокуратури, де здобув глибокі знання системи зсередини. Має потужний досвід процесуального керівництва у кримінальних провадженнях щодо тяжких та особливо тяжких злочинів, що дозволяє бачити кожну справу на кілька кроків уперед. Добре знає, як будується обвинувачення, тому ефективно виявляє слабкі місця в позиції опонентів та забезпечує безумовний захист прав своїх клієнтів.",
    photo: "/img/Yasmaneckiy.jpg",
  }
]

export function TeamSection() {
  return (
    <section id="team" className="py-24 md:py-30 px-8 md:px-16 bg-white" aria-label="Наша команда">
      <div className="max-w-6xl mx-auto">

        <Title sup={'Команда фахівців'} title={'Наша команда'} />

        <div className="grid grid-cols-1 gap-8 md:gap-10 md:grid-cols-3 sm:grid-cols-2">
          {TEAM.map((person) => (
            <Person key={person.name} name={person.name} role={person.role} bio={person.bio} photo={person.photo} />
          ))}
        </div>

      </div>
    </section>
  )
}