import { Title } from "@/components/Title";
import { Person } from "@/components/Person";

const TEAM = [
  {
    name: "Лідія Горбунова",
    role: "Голова Адвокатського об’єднання",
    bio: "Заслужений юрист України, кандидат юридичних наук, доцент, професор Київського міжнародного університету. Має великій досвід законопроєктної роботи та проведення правової експертизи нормативно-правових актів. Більше 20 років працювала в Міністерстві юстиції України, з них 11 років займала посаду Заступника Міністра юстиції. Має наукові праці в галузі адміністративного права та державного управління. Адвокат з великим досвідом адвокатської діяльності в галузі адміністративного, цивільного та господарського права. Експерт у вирішенні сімейних та трудових спорів.",
    photo: "/img/Lidia.jpg",
  },
  {
    name: "Іван Тулик",
    role: "Заступник Голови Об’єднання",
    bio: "Адвокат із стажем роботи у галузі права більше 27 років. Кандидат юридичних наук. Більше 18 років працював на посаді судді районного суду, розглядав цивільні та кримінальні справи. З 2025 року адвокат, експерт з розгляду сімейних, спадкових та кримінальних справ.",
    photo: "/img/Tulik.jpg",
  },
  {
    name: "Ольга Німак",
    role: "Заступник Голови Об’єднання",
    bio: "Адвокат з 20-річним стажем  роботи у сфері права, з яких 10 років присвячено адвокатській діяльності. Має великий досвід адвокатської діяльності у сфері господарського, податкового та цивільного права. Має свою стратегію по захисту інтересів бізнесу. Здійснює ефективний юридичний захист завдяки глибокого аналізу ситуації, розуміння ризиків і правильно обраної правової стратегії. Знаходить правове рішення, яке найкраще захищає інтереси клієнта.",
    photo: "/img/Nimak.jpg",
  },
  {
    name: "Людмила Свистун",
    role: "Асоційований партнер, представник у Вінницькій області",
    bio: "Адвокат з великім досвідом роботи в сфері права, зокрема, нотаріату, магістр права. Член Національної асоціації адвокатів України. Надає кваліфіковану юридичну допомогу у сфері цивільного права, зокрема, земельні, спадкові, сімейні, кредитні, трудові, договірні спори, а також адміністративного права. Здійснює захист прав та інтересів військовослужбовців та членів їх сімей. Основними принципами роботи є професійність, індивідуальний підхід до вирішення справ та пріоритет інтересів клієнта.",
    photo: "/img/Svistun.jpeg",
  },
  {
    name: "Олександра Сарапіна",
    role: "Асоційований партнер, керівник представництва у Волинській області",
    bio: "Адвокат із понад 15-річним досвідом роботи у сфері права та 6-річним адвокатським стажем. Основна спеціалізація - захист прав та інтересів військовослужбовців і військовозобов’язаних. Понад 4 роки професійної практики присвяченої супроводу військовослужбовців та військовозобов’язаних, захисту їхніх прав і законних інтересів, а також вирішенню правових питань, що виникають під час проходження військової служби та виконання військового обов’язку.",
    photo: "/img/Sarapina.jpg",
  },
  {
    name: "Вадим Яксманецький",
    role: "Асоційований партнер, представник в Дніпропетровській області",
    bio: "Адвокат із 15-річним стажем роботи в органах прокуратури, де здобув глибокі знання системи зсередини. Має потужний досвід процесуального керівництва у кримінальних провадженнях щодо тяжких та особливо тяжких злочинів, бачить  кожну справу на кілька кроків уперед. Знає, як будується обвинувачення, тому ефективно виявляє слабкі місця в позиції опонентів та забезпечує безумовний захист прав своїх клієнтів. Має мету - мінімізацію ризиків та пошук оптимального рішення навіть у найскладніших ситуаціях.",
    photo: "/img/Yasmaneckiy.jpg",
  },
  {
    name: "Василь Кравчук",
    role: "Асоційований партнер, керівник представництва в Житомирській області",
    bio: "Адвокат з великім досвідом роботи, головний пріоритет якого — надавати клієнтам якісні юридичні послуги та послідовно захищати їхні інтереси.  Приймає участь у кримінальних, адміністративних, цивільних і трудових справах, а в кримінальних провадженнях захищає клієнтів на досудовому розслідуванні та в суді. До кожної справи підходить індивідуально: визначає найбільш ефективну позицію та обґрунтовує її нормами права і практикою Верховного Суду та Європейського суду з прав людини.",
    photo: "/img/Kravchyk.jpg",
  },
  {
    name: "Олександр Резуненко",
    role: "Асоційований партнер, керівник представництва в Закарпатській області",
    bio: "Практикуючий адвокат із понад 20-річним безперервним досвідом у сфері права. Спеціалізується на комплексній безпеці бізнесу, захисті від протиправних дій правоохоронних та контролюючих органів, а також представництві інтересів у складних кримінальних, господарських, податкових та митних справах. Має у доробку понад 10 виправдувальних вироків за Кримінальним процесуальним кодексом України 2012 року. Успішно здійснював захист топ-посадовців державних органів та топ-менеджменту підприємств. Реалізував ефективні стратегії захисту під час обшуків, допитів, арешту майна та вилучення документів.",
    photo: "/img/Rezunenko.jpg",
  },
  {
    name: "Мирослав Гусельников",
    role: "Асоційований партнер, керівник представництва в Запорізькій області",
    bio: "Адвокат із понад 25-річним професійним досвідом. Спеціалізується на захисті інтересів власників бізнесу, підприємців і керівників компаній у складних кримінальних, господарських, цивільних та адміністративних спорах. Має значний досвід ведення резонансних і комплексних судових справ, кримінального захисту бізнесу та розробки процесуальних і переговорних стратегій. У роботі поєднує глибокий правовий аналіз із розумінням бізнес-ризиків та практичних наслідків юридичних рішень. Основний принцип роботи - формування ефективної стратегії, спрямованої на захист активів, репутації та управлінських інтересів клієнта.",
    photo: "/img/Guselnikov.jpg",
  },
  {
    name: "Лілія Карбівська",
    role: "Асоційований партнер, представник в Івано-Франківській області",
    bio: "Адвокат з понад 20-річним досвідом роботи  у сфері права. Спеціалізується на  цивільних, сімейних та адміністративних спорах. Експерт по стягнення боргів і аліментів, поновлення на роботі, виконання судових рішень. Має також досвід роботи по веденню військових та кримінальних справ: СЗЧ, оскарження постанов ТЦК, захист військовослужбовців. Підходить до ведення справ  конкретно та наполегливо, без зайвих обіцянок, але з повною віддачею справі.",
    photo: "/img/Karibovska.jpg",
  },
  {
    name: "Ангеліна Дуднік",
    role: "Асоційований партнер, керівник представництва в Кіровоградській області",
    bio: "Адвокат. Медіатор. Аналітичний психолог. Понад 15 років професійної адвокатської практики. Має юридичну освіту у сфері правознавства та міжнародного права, спеціальну підготовку у сфері судової діяльності, а також освіту з психології, психоаналізу та методів глибинної психології. Здійснює захист і представництво у кримінальних, цивільних, господарських та адміністративних справах, розробляючи індивідуальні правові стратегії відповідно до конкретної ситуації клієнта.",
    photo: "/img/Dydnik.jpg",
  },
  {
    name: "Юлія Гапішко",
    role: "Асоційований партнер, представник в Миколаївській області",
    bio: "Адвокатка, яка спеціалізується на судовому представництві та комплексному правовому супроводі фізичних і юридичних осіб. Має значний досвід роботи у сфері юриспруденції, зокрема в органах державної виконавчої служби, державних установах та державному підприємстві. Практикує у сферах цивільного, господарського, трудового та адміністративного права. У роботі поєднує глибокий аналіз законодавства і судової практики з практичним розумінням механізмів роботи державних органів та підприємств.",
    photo: "/img/Gapishko.jpg",
  },
  {
    name: "Олексій Бордюгов",
    role: "Асоційований партнер, керівник представництва в Одеській області",
    bio: "Адвокат з понад 20-річним досвідом роботи в правоохоронних органах, в слідчих та оперативних підрозділах, з яких більше 10 років  в підрозділах боротьби з економічними злочинами та протидії корупції. Експерт з ефективного захисту бізнесу та посадових осіб у кримінальних провадженнях щодо економічних правопорушень. Фахівець в області кримінального права та процесу, антикорупційного законодавства, блискуче знання теорії та практики, вміле використання на користь клієнта. Досвідчений адвокат по ДТП,  корисним злочинам, злочинам проти життя та здоров'я, незаконним обігом наркотичних речовин.",
    photo: "/img/Bordugov.jpg",
  },
  {
    name: "Ірина Зейкан",
    role: "Асоційований партнер, представник у Рівненській області",
    bio: "Адвокат із 20 річним стажем роботи у сфері права та 15 річним досвідом адвокатської діяльності. Має досвід роботи слідчого та помічника судді. Спеціалізується на розгляді кримінальних, цивільних, адміністративних та господарських справах.",
    photo: "/img/Zeikan.jpg",
  },
  {
    name: "Оксана Василенко",
    role: "Асоційований партнер, представник у Тернопільській області",
    bio: "Адвокат з понад 10-річним  професійним досвідом роботи у сфері права. Закінчила Національну юридичну академію України імені Ярослава Мудрого з відзнакою. Професійний шлях розпочала в органах прокуратури, де набула значного досвіду правозастосовної діяльності. Із 2022 року здійснюю адвокатську діяльність, забезпечуючи професійний правовий супровід, захист інтересів клієнтів та пошук ефективних рішень у правових питаннях.",
    photo: "/img/Vasilenko.jpg",
  },
  {
    name: "Оксана Вітязь",
    role: "Асоційований партнер, представник у Хмельницькій області",
    bio: "Адвокат із 15-річним стажем адвокатською діяльності. Основна спеціалізація – медичне право. Член Ради Комітету медичного і фармацевтичного права та біоетики НААУ, викладач-тренер для адвокатів з медичного права. Отримала Сертифікат НААУ України про допуск до організації та проведення заходів підвищення кваліфікації адвокатів за темою: «Лікарська таємниця». Лектор Вищої школи адвокатури. Директор ТОВ «Адвокатське бюро «Валері».",
    photo: "/img/Vityaz.jpg",
  },
  {
    name: "Ярослав Борзов",
    role: "Асоційований партнер, представник у Черкаській області",
    bio: "З відзнакою закінчив Національну академію внутрішніх справ, здобувши ступінь магістра права. Має практичний досвід роботи в правоохоронних органах на посадах оперуповноваженого та слідчого, а також у сфері юридичного супроводу бізнесу. Є засновником юридичної компанії «Аблекс» та членом Асоціації правників України. Основні напрями практики: неплатоспроможність фізичних осіб, банкрутство юридичних осіб, кредитні спори, цивільні, господарські та сімейні справи, договірні правовідносини, представництво інтересів клієнтів у судах та комплексний юридичний супровід бізнесу.",
    photo: "/img/Borzov.jpg",
  },
  {
    name: "Ольга Гаврелюк",
    role: "Асоційований партнер, представник в Чернівецькій області",
    bio: "Досвідчений адвокат з 20-річним стажем роботи у сфері права, готовий підтримати вас у найскладніших життєвих ситуаціях. До кожної справи адвокат підходить комплексно, виважено, всебічно аналізує питання та нюанси, які можуть вплинути на бажаний результат. Спеціалізується у сімейних, земельних, трудових, господарських корпоративних, адміністративних, податкових, житлових (спадкових), військових справах. Експерт по встановлення родинних зв'язків, відстоювання прав українців при посольстві в Італії. Надає безкоштовні консультації для ЗСУ.",
    photo: "/img/Gavrelyk.jpg",
  },
  {
    name: "Леся Кульгейко",
    role: "Асоційований партнер, керівник представництва в Чернігівській області",
    bio: "Кваліфікована юристка із багаторічним досвідом комплексного правового супроводу бізнесу в ключових секторах економіки, зокрема у агропромисловому комплексі, торгівлі, логістиці та ЗЕД. Експерт в області галузей права, необхідних для стабільної роботи підприємств: від господарського, податкового й корпоративного до цивільного та адміністративного законодавства. Досконало володіє земельним правом та має багаторічну успішну практику вирішення складних земельних спорів і захисту інтересів власників та землекористувачів.",
    photo: "/img/Kylgeiko.jpg",
  },
]

export function TeamSection() {
  return (
    <section id="team" className="py-24 md:py-30 px-8 md:px-16 bg-white" aria-label="Наша команда">
      <div className="max-w-6xl mx-auto">

        <Title sup={'Команда фахівців'} title={'Наша команда'} />

        <div className="grid grid-cols-1 gap-8 md:gap-10 md:grid-cols-3 sm:grid-cols-2">
          {TEAM.map((person) => (
            <Person key={person.name} name={person.name} role={person.role} bio={person.bio} photo={person.photo} />
          ))}
        </div>

      </div>
    </section>
  )
}