import { Title } from "@/components/Title";
import { Person } from "@/components/Person";

const TEAM = [
  {
    name: "Лідія Горбунова",
    role: "Голова Адвокатського об’єднання",
    bio: "Заслужений юрист України, кандидат юридичних наук, доцент, професор Київського міжнародного університету. Має великій досвід законопроєктної роботи та проведення правової експертизи нормативно-правових актів. Більше 20 років працювала в Міністерстві юстиції України, з них 11 років займала посаду Заступника Міністра юстиції. Має наукові праці в галузі адміністративного права та державного управління. Адвокат з великим досвідом адвокатської діяльності в галузі адміністративного, цивільного та господарського права. Експерт у вирішенні сімейних та трудових спорів.",
    photo: "/img/Lidia.jpg",
  },
  {
    name: "Іван Тулик",
    role: "Заступник Голови Об’єднання",
    bio: "Адвокат із стажем роботи у галузі права більше 27 років. Кандидат юридичних наук. Більше 18 років працював на посаді судді районного суду, розглядав цивільні та кримінальні справи. З 2025 року адвокат, експерт з розгляду сімейних, спадкових та кримінальних справ.",
    photo: "/img/Tulik.jpg",
  },
  {
    name: "Ольга Німак",
    role: "Заступник Голови Об’єднання",
    bio: "Адвокат з 20-річним стажем  роботи у сфері права, з яких 10 років присвячено адвокатській діяльності. Має великий досвід адвокатської діяльності у сфері господарського, податкового та цивільного права. Має свою стратегію по захисту інтересів бізнесу. Здійснює ефективний юридичний захист завдяки глибокого аналізу ситуації, розуміння ризиків і правильно обраної правової стратегії. Знаходить правове рішення, яке найкраще захищає інтереси клієнта.",
    photo: "/img/Nimak.jpg",
  },
  {
    name: "Мирослав Гусельников",
    role: "Асоційований партнер, керівник представництва в Запорізькій області",
    bio: "Адвокат із понад 25-річним професійним досвідом. Спеціалізується на захисті інтересів власників бізнесу, підприємців і керівників компаній у складних кримінальних, господарських, цивільних та адміністративних спорах. Має значний досвід ведення резонансних і комплексних судових справ, кримінального захисту бізнесу та розробки процесуальних і переговорних стратегій. У роботі поєднує глибокий правовий аналіз із розумінням бізнес-ризиків та практичних наслідків юридичних рішень. Основний принцип роботи - формування ефективної стратегії, спрямованої на захист активів, репутації та управлінських інтересів клієнта.",
    photo: "/img/Guselnikov.jpg",
  },
  {
    name: "Вадим Яксманецький",
    role: "Асоційований партнер, представник в Дніпропетровській області",
    bio: "Адвокат із 15-річним стажем роботи в органах прокуратури, де здобув глибокі знання системи зсередини. Має потужний досвід процесуального керівництва у кримінальних провадженнях щодо тяжких та особливо тяжких злочинів, бачить  кожну справу на кілька кроків уперед. Знає, як будується обвинувачення, тому ефективно виявляє слабкі місця в позиції опонентів та забезпечує безумовний захист прав своїх клієнтів. Має мету - мінімізацію ризиків та пошук оптимального рішення навіть у найскладніших ситуаціях.",
    photo: "/img/Yasmaneckiy.jpg",
  },
  {
    name: "Ангеліна Дуднік",
    role: "Асоційований партнер, керівник представництва в Кіровоградській області",
    bio: "Адвокат. Медіатор. Аналітичний психолог. Понад 15 років професійної адвокатської практики. Має юридичну освіту у сфері правознавства та міжнародного права, спеціальну підготовку у сфері судової діяльності, а також освіту з психології, психоаналізу та методів глибинної психології. Здійснює захист і представництво у кримінальних, цивільних, господарських та адміністративних справах, розробляючи індивідуальні правові стратегії відповідно до конкретної ситуації клієнта.",
    photo: "/img/Dydnik.jpg",
  },
  {
    name: "Василь Кравчук",
    role: "Асоційований партнер, керівник представництва в Житомирській області",
    bio: "Адвокат з великім досвідом роботи, головний пріоритет якого — надавати клієнтам якісні юридичні послуги та послідовно захищати їхні інтереси.  Приймає участь у кримінальних, адміністративних, цивільних і трудових справах, а в кримінальних провадженнях захищає клієнтів на досудовому розслідуванні та в суді. До кожної справи підходить індивідуально: визначає найбільш ефективну позицію та обґрунтовує її нормами права і практикою Верховного Суду та Європейського суду з прав людини.",
    photo: "/img/Kravchyk.jpg",
  },
  {
    name: "Леся Кульгейко",
    role: "Асоційований партнер, керівник представництва в Чернігівській області",
    bio: "Кваліфікована юристка із багаторічним досвідом комплексного правового супроводу бізнесу в ключових секторах економіки, зокрема у агропромисловому комплексі, торгівлі, логістиці та ЗЕД. Експерт в області галузей права, необхідних для стабільної роботи підприємств: від господарського, податкового й корпоративного до цивільного та адміністративного законодавства. Досконало володіє земельним правом та має багаторічну успішну практику вирішення складних земельних спорів і захисту інтересів власників та землекористувачів.",
    photo: "/img/Kylgeiko.jpg",
  },
  {
    name: "Юлія Гапішко",
    role: "Асоційований партнер, представник в Миколаївській області",
    bio: "Адвокатка, яка спеціалізується на судовому представництві та комплексному правовому супроводі фізичних і юридичних осіб. Має значний досвід роботи у сфері юриспруденції, зокрема в органах державної виконавчої служби, державних установах та державному підприємстві. Практикує у сферах цивільного, господарського, трудового та адміністративного права. У роботі поєднує глибокий аналіз законодавства і судової практики з практичним розумінням механізмів роботи державних органів та підприємств.",
    photo: "/img/Gapishko.jpg",
  },
  {
    name: "Олександр Резуненко",
    role: "Асоційований партнер, керівник представництва в Закарпатській області",
    bio: "Практикуючий адвокат із понад 20-річним безперервним досвідом у сфері права. Спеціалізується на комплексній безпеці бізнесу, захисті від протиправних дій правоохоронних та контролюючих органів, а також представництві інтересів у складних кримінальних, господарських, податкових та митних справах. Має у доробку понад 10 виправдувальних вироків за Кримінальним процесуальним кодексом України 2012 року. Успішно здійснював захист топ-посадовців державних органів та топ-менеджменту підприємств. Реалізував ефективні стратегії захисту під час обшуків, допитів, арешту майна та вилучення документів.",
    photo: "/img/Rezunenko.jpg",
  },
  {
    name: "Олексій Бордюгов",
    role: "Асоційований партнер, керівник представництва в Одеській області",
    bio: "Адвокат з понад 20-річним досвідом роботи в правоохоронних органах, в слідчих та оперативних підрозділах, з яких більше 10 років  в підрозділах боротьби з економічними злочинами та протидії корупції. Експерт з ефективного захисту бізнесу та посадових осіб у кримінальних провадженнях щодо економічних правопорушень. Фахівець в області кримінального права та процесу, антикорупційного законодавства, блискуче знання теорії та практики, вміле використання на користь клієнта. Досвідчений адвокат по ДТП,  корисним злочинам, злочинам проти життя та здоров'я, незаконним обігом наркотичних речовин.",
    photo: "/img/Bordugov.jpg",
  }
]

export function TeamSection() {
  return (
    <section id="team" className="py-24 md:py-30 px-8 md:px-16 bg-white" aria-label="Наша команда">
      <div className="max-w-6xl mx-auto">

        <Title sup={'Команда фахівців'} title={'Наша команда'} />

        <div className="grid grid-cols-1 gap-8 md:gap-10 md:grid-cols-3 sm:grid-cols-2">
          {TEAM.map((person) => (
            <Person key={person.name} name={person.name} role={person.role} bio={person.bio} photo={person.photo} />
          ))}
        </div>

      </div>
    </section>
  )
}